[{"id":1609016400,"title":"Privacy Policy\r","author":"Shangeet Shankar\r","date":"December 27, 2020\r","content":"\r\nThis Privacy Policy describes the type or treatment of information provided or collected on the\r\nPlatform where this privacy policy is posted. It also explains the treatment of information\r\nprovided or collected on Platform. We make available on third-party sites or platforms if\r\ndisclosed to You in connection with use of the Platform. We follow this privacy policy in\r\naccordance with local law in the place where we operate.\r\nWe collect, purpose, usage, storage and handling of such information, and disclosure thereof.\r\nWe encourage You to read this Privacy Policy carefully when (i) using Our Platform from any\r\ncomputer, computer device, mobile, smartphone or any electronic device, or (ii) availing any\r\nproducts or services offered on or through the Platform.\r\nBy using Our Platform, You are hereby consenting to collection of Your information by Us. The\r\ninformation in some cases may include Personal Information and Sensitive Personal\r\nInformation. In case of collection of Sensitive Personal Information, You will be required to click\r\non the box below, confirming Your acceptance of this Privacy Policy. By accepting this Privacy\r\nPolicy You are representing that You are eighteen (18) years of age or above. In case You are\r\nunder the age of eighteen (18) years, then You are requested to not share any Sensitive\r\nPersonal Information or Personal Information with us without having Your Parents to accept this\r\nPrivacy Policy on Your behalf.\r\n**WHAT INFORMATION DO WE COLLECT?**\r\n\r\n1. At the outset, You are free to refrain from sharing Your information with Us. When You\r\n    use the Platform, We may collect two basic types of information - Your personal and\r\n    anonymous information and we may use personal and anonymous information to create\r\n    a third type of information, aggregate information. We may also collect information which\r\n    may be Sensitive Personal Information. We collect the following categories of\r\n    information:\r\n       1. Registration information You provide when You create an account, including Your\r\n          first name and surname, country of residence, gender, date of birth, email\r\n          address, username and password.\r\n       2. Transaction information You provide when You request information or purchase a\r\n          product or service from Us, whether on our Platform, including your postal\r\n          address, telephone number and payment information.\r\n       3. Information You provide in public forums on Our Platform.\r\n\r\n\r\n4. Information sent either one-to-one or within a limited group using Our message,\r\n    chat, post or similar functionality, where We are permitted by law to collect this\r\n    information.\r\n5. Information You provide to Us when You use Our Platform, Our Platform on\r\n    third-party sites or platforms such as social networking sites or link Your profile\r\n    on a third-party site or platform with Your registration account.\r\n6. Location information when You visit Our Platform, including location information\r\n    either provided by a mobile device interacting with one of Our Platform, website\r\n    or Application, or associated with your IP address, where We are permitted by\r\n    law to process this information.\r\n7. Usage, viewing and technical data, including Your device identifier or IP address,\r\n    when You visit Our Platform on third-party sites or platforms or open emails we\r\n    send.\r\n\r\n### 2. How We Collect Your Information?\r\n\r\n1. In order to register as a user with the Platform, You can either create an account on Our\r\n    Platform. Alternatively, You can sign in using Your Facebook/Google/ any other social\r\n    networking website login. If You do so, You authorize Us to access certain\r\n    Facebook/Google or any other social networking website account information, such as\r\n    Your public Facebook/Google or any other social networking website profile (consistent\r\n    with your privacy settings in Facebook/Google or any other social networking website).\r\n    You will also be asked to allow Us to collect Your location and movement, Fitness\r\n    information from the device when You use the Platform.\r\n2. We collect information You provide to Us when You request products, services or\r\n    information from Us, register with Us, participate in public forums or other activities on\r\n    Our Platform, respond to customer surveys, or otherwise interact with Us. Please keep in\r\n    mind that when You provide information to Us on a third-party site or platform (for\r\n    example, via Our Platform), the information You provide may be separately collected by\r\n    the third-party site or platform. The information We collect is covered by this privacy\r\n    policy and the information the third-party site or platform collects is subject to the\r\n    third-party site or platform’s privacy practices. Privacy choices You have made on the\r\n    third-party site or platform will not apply to Our use of the information We have collected\r\n    directly through Our Platform.\r\n3. You provide while using Our Platform or in some other manner. You may also provide\r\n    Us photos, a personal description and information about Your gender and preferences.\r\n    In case any chat facility is provided through the Platform and if You chat with other\r\n    Platform users, You provide Us the content of Your chats, and If You contact Us for\r\n    customer service or other inquiry, You provide Us with the content of that\r\n    communication.\r\n\r\n\r\n4. We neither knowingly collect any information nor promote Our Platform to any minor\r\n    under the age of 18 (eighteen) years. If You are less than 18 (eighteen) years old or a\r\n    minor in any other jurisdiction from where You access Our Platform, We request that\r\n    You do not submit information to Us. If We become aware that a minor has registered\r\n    with Us and provided Us with personal information, We may take steps to terminate such\r\n    person’s registration and delete their account with Us.\r\n5. We use various tools and technologies, such as cookies, Flash cookies and Web\r\n    beacons, including when You visit Our Platform or use Our Platform on third-party sites\r\n    or platforms, to collect Your personal information and non-personal information from the\r\n    device from which You access the Platform and learn about Your activities taking place\r\n    under Your account when You use Our Platform. Such non-personal information could\r\n    include Your IP address, device ID and type, Your browser type and language, operating\r\n    system used by Your device, access times, Your device geographic location and the\r\n    referring website address. We may use web beacons and other similar technologies to\r\n    track Your use of Our Platform and to deliver or communicate with cookies.\r\n6. Advertising networks service providers, web traffic analysis service providers, Our\r\n    business partners and vendors and other third parties may also use cookies, which is\r\n    beyond Our control. These would most likely be analytical/performance cookies or\r\n    targeting cookies. Blocking such cookies is possible by activating the appropriate\r\n    settings on Your device browser. However, this may affect the functionality of the\r\n    Platform.\r\n7. We acquire information from other trusted sources to update or supplement the\r\n    information You provided, or We collected automatically. Local law may require that you\r\n    authorize the third party to share Your information with Us before We can acquire it.\r\n**HOW WE USE THE INFORMATION WE COLLECT?**\r\nA member of Our Company, which includes many different brands, will be the data controller for\r\nYour information. A user can reach out to our data controllers by sending an email to\r\nprivacy@pipory.com. Other members of Our Company may have access to Your information\r\nwhere they perform services on behalf of the data controller(s) (as a data processor) and,\r\nunless prohibited under applicable law, for use on their own behalf (as a data controller) for the\r\nfollowing purposes:\r\n1. deliver and improve Our Platform and manage Our business;\r\n2. manage Your account and provide You with customer support;\r\n3. tracking of Your physical movement, Fitness and location for step count and coin\r\nconversion;\r\n4. creating daily leader board rankings;\r\n5. providing access to offers and facilitating transactions for availing Ours and third\r\nparty’s goods and services through the Platform;\r\n6. perform research and analysis about Your use of, or interest in, Our or third\r\nparty’s products, services, or content or such products, services, or content as\r\nmay be available on or through the Platform;\r\n\r\n\r\n7. communicate with You by email, postal mail, telephone and/or mobile devices\r\n    about products or services that may be of interest to You either from Us or third\r\n    parties or such products, services, or content as may be available on or through\r\n    the Website;\r\n8. develop, display, and track content and advertising tailored to Your interests on\r\n    Our App, including providing advertisements to You;\r\n9. undertake Platform analytics;\r\n10.enforce or exercise any rights in our Platform Terms and Conditions;\r\n11.perform functions or services as otherwise described to You at the time of\r\n    collection; and\r\n12.resolve disputes, diagnose errors, troubleshoot problems, detect and protect Us\r\n    against any activity not expressly authorized under the Platform Terms &\r\n    Conditions as available at the​ ​link​.\r\n13.consistent with local law and choices and controls that may be available to you:\r\n    1. send you offers and promotions for our products and services or\r\n       third-party products and services;\r\n    2. personalize content and experiences on Our Platform;\r\n    3. provide you with advertising based on your activity on Our Platform and\r\n       on third-party sites and applications.\r\n**WITH WHOM WE SHARE YOUR INFORMATION?**\r\n1. When You register as a user of Our Platform, Your profile details (information You have\r\nprovided Us directly or through your Facebook/Google or any other social networking\r\nwebsite account) will be accessible and viewable by other Platform users and Our\r\nbusiness partners, sub-contractors, payment and delivery service providers, advertising\r\nnetworks, analytics providers, search information providers and credit reference\r\nagencies.\r\n2. We do not share Your personal information with others except as indicated in this\r\nPrivacy Policy or when We inform You and give You an opportunity to opt out of having\r\nYour personal information shared.\r\n3. We may also disclose Your personal information:\r\n1. for complying with applicable laws, requests or orders from law enforcement\r\nagencies, appropriate competent authorities or for any legal process;\r\n2. for enforcing the Platform Terms and Conditions;\r\n3. for protecting or defending Ours, any Platform user’s or any third party's rights or\r\nproperty;\r\n4. for supporting any fraud/ legal investigation/ verification checks; or\r\n5. in connection with a corporate transaction, including but not limited to sale of Our\r\nbusiness, merger, consolidation, or in the unlikely event of bankruptcy.\r\n4. We may use and share Your non-personal information We collect under any of the\r\nabove circumstances, including with third parties to develop and deliver targeted\r\n\r\n\r\nadvertising on Our Platform and on websites and/or applications of third parties, and to\r\nundertake analysis thereof. We may combine non-personal information We collect with\r\nadditional non-personal information collected from other sources. We also may share\r\naggregated, non-personal information, or personal information in hashed, non-human\r\nreadable form, with third parties, including advisors, advertisers and investors, for the\r\npurpose of conducting general business analysis or other business purposes.\r\n**HOW CAN YOU ACCESS OR CONTROL YOUR INFORMATION?**\r\nYou may correct, update and delete your registration account;\r\nYou may change your choices for subscriptions, newsletters and alerts;\r\nYou may choose whether to receive from us offers and promotions for our products and\r\nservices, or products and services that we think may be of interest to you;\r\nIf You have an account with Us on Our Platform, We provide You the ability to exercise certain\r\ncontrols regarding our collection, use, and sharing of Your information in the privacy and\r\nsecurity section of the app.\r\nYou can choose not to provide Us with certain information; however please be aware this may\r\nresult in You being unable to use certain features of Our Platform. Our Platform may also deliver\r\nnotifications to Your email or mobile device. You can avoid or disable these notifications by\r\ndeleting or terminating the Platform or by making changes in the Platform settings.\r\nYou are solely liable and responsible for any information You provide and/or share using the\r\nPlatform.\r\n**HOW DO WE PROTECT YOUR PERSONAL INFORMATION?**\r\nWe adopt reasonable security practices and procedures to help safeguard Your personal\r\ninformation under Our control from unauthorized access. However, You acknowledge that no\r\nInternet transmission or system or server can be 100% secure. Therefore, although We take all\r\nreasonable steps to secure Your personal information, We do not promise or guarantee the\r\nsame, and You should not expect that Your personal information, or other communications\r\nwhile using the Platform will always remain secure and safeguarded by Us. You should always\r\nexercise caution while providing, sharing, or disclosing Your personal information using the\r\nPlatform\r\n**DATA SECURITY AND INTEGRITY**\r\nThe security, integrity and confidentiality of Your information are extremely important to Us. We\r\nhave implemented technical, administrative and physical security measures that are designed to\r\nprotect guest information from unauthorized access, disclosure, use and modification. From time\r\nto time, We review Our security procedures to consider appropriate new technology and\r\nmethods. Please be aware though that, despite Our best efforts, no security measures are\r\nperfect or impenetrable.\r\n\r\n\r\n#### DATA TRANSFERS, STORAGE AND PROCESSING GLOBALLY\r\n\r\nWhile We do not operate globally, and We may / may not transfer your Personal Information to\r\nany third parties in locations around the world for the purposes described in this Privacy Policy.\r\nWherever your personal information is transferred, stored or processed by us, we will take\r\nreasonable steps to safeguard the privacy of your personal information.\r\n**CHANGES TO THIS PRIVACY POLICY**\r\nWe may occasionally update this Privacy Policy. When We post changes to this Privacy Policy,\r\nWe will revise the \"last updated\" date. We recommend that You check Our Platform from time to\r\ntime to keep Yourself updated of any changes in this Privacy Policy or any of Our other Platform\r\nrelated terms and policies."},{"id":1608757200,"title":"Terms of Service\r","author":"Shangeet Shankar\r","date":"December 24, 2020\r","content":"\r\n**This document is an electronic record in terms of Information Technology Act, 2000 and\r\nrules there under as applicable and the amended provisions pertaining to electronic\r\nrecords in various statutes as amended by the Information Technology Act, 2000. This\r\nelectronic record is generated by a computer system and does not require any physical\r\nor digital signatures.\r\nThis document is published in accordance with the provisions of Rule 3 (1) of the\r\nInformation Technology (Intermediaries guidelines) Rules, 2011 that require publishing\r\nthe rules and regulations, privacy policy, and Terms of Use for access or usage of\r\nhttps://pipory.com/** ​ **website and/ or Pipory mobile application.\r\nThe domain name** ​ **https://pipory.com/** ​ ​ **(hereinafter referred to as “Website”) and the\r\nmobile application Pipory (hereinafter referred to as “Application”) are owned by Pipory\r\nPrivate Limited a company incorporated under the Companies Act, 2013 (hereinafter\r\nreferred to as “Pipory”).\r\nBy accessing or using the Website/ Application, the Pipory Service, or any other\r\napplications (including mobile applications) made available by Pipory (together, the\r\n“Service”), however accessed, You agree to be bound by these terms of use (“Terms of\r\nUse”). The Service is owned and controlled by Pipory. You are suggested to go through\r\nthese terms before using Pipory. These Terms of Use affect Your legal rights and\r\nobligations. If You do not agree to be bound by all of these Terms of Use, do not access\r\nor use the Service.**\r\nFor the purpose of these Terms of Use, wherever the context so requires​ **“You”, “Your”** ​ or\r\n**“User”** ​ and variants thereof shall mean any natural or legal person who has agreed to become\r\na user of the Service by providing Registration Data while registering on the Service using a\r\ncomputer system. The term ​ **“We”** ​,​ **“Us”** ​,​ **“Our”** ​ and variants thereof shall mean Pipory.\r\n**ACCESSING, BROWSING OR OTHERWISE USING THE SITE INDICATES YOUR\r\nAGREEMENT TO ALL THE TERMS AND CONDITIONS UNDER THESE TERMS OF USE, SO\r\nPLEASE READ THE TERMS OF USE CAREFULLY BEFORE PROCEEDING.** ​ By impliedly or\r\nexpressly accepting these Terms of Use, You also accept and agree to be bound by Pipory\r\npolicies (including but not limited to Privacy Policy)as amended from time to time (together\r\nreferred to as “Pipory Policies”).\r\nWe reserve the right, at Our sole discretion, to change, modify, add or remove portions of these\r\nTerms of Use, at any time without any prior written notice to You. It is Your responsibility to\r\nreview these Terms of Use periodically for updates/changes. Your continued use of the Service\r\nfollowing the posting of changes will mean that You accept and agree to the revisions. As long\r\n\r\n\r\nas You comply with these Terms of Use, We grant You a personal, non-exclusive,\r\nnon-transferable, limited privilege to enter and use the Service.\r\n\r\n1. The minimum age to use the App is 18 (eighteen) years. By using the App and in order to be\r\ncompetent to contract under applicable law, You represent and warrant that You are at least 18\r\n(eighteen) years of age or not a minor in any other jurisdiction from where You access Our App.\r\nBy using the App, You hereby represent and warrant to Us that You have all right, authority and\r\ncapacity to enter into these App Terms and Conditions and to abide by all of the terms and\r\nconditions thereof.\r\n2. You are responsible for ensuring that in Your use of the Service, Your action or omission is\r\nnot contrary to any law for the time being in force. You are not allowed to post violent,\r\ndiscriminatory, plagiarized, promotional, unlawful, infringing, trolling, hateful Content via the\r\nService. For the purposes of clarity, Content refers to any data, text, information, usernames,\r\nworks of authorship, links, and other content or materials, including information that the User\r\nposts and/ or uploads on to the service, such as but not limited to the write-ups, photographs,\r\ngraphics, videos, and any other information formats that may become shareable via the Service\r\nfrom time to time (collectively “Content”). You specifically undertake not to host, display, upload,\r\nmodify, publish, transmit, update or share any information that –\r\na. belongs to another person and to which the user does not have any right to;\r\nb. is grossly harmful, harassing, blasphemous, defamatory, obscene, pornographic, paedophilic,\r\nlibelous, invasive of another’s privacy, hateful, or racially, ethnically objectionable, disparaging,\r\nrelating to or encouraging money laundering or gambling, or otherwise unlawful in any manner\r\nwhatever;\r\nc. harm minors in any way;\r\nd. infringes any patent, trademark, copyright, or other proprietary rights;\r\ne. violates any law for the time being in force;\r\nf. deceives or misleads the addressee about the origin of such messages or communicates any\r\ninformation which is grossly offensive or menacing in nature;\r\ng. impersonate another person;\r\nh. contains software viruses or any other computer code, files, or programs designed to\r\ninterrupt, destroy or limit the functionality of any computer resource;\r\ni. threatens the unity, integrity, defense, security or sovereignty of India, friendly relations with\r\nforeign states, or public order or causes incitement to the commission of any cognizable offense\r\nor prevents investigation of any offense or is insulting any other nation.\r\n\r\n\r\nBreach of these Terms of Use on Your part would lead to a removal of any and all of Your\r\nContent and revoke Your posting rights. Repeated breach will lead to a permanent account ban,\r\nand You may not be permitted to access the Service ever again.\r\n\r\n3. You are responsible for any activity that occurs through Your account and You agree You will\r\nnot sell, transfer, license or assign Your account, followers, username, or any account rights.\r\nWith the exception of people or businesses that are expressly authorized to create accounts on\r\nbehalf of their employers or clients, Pipory prohibits the creation of and You agree that You will\r\nnot create an account for anyone other than Yourself. You also represent that all information\r\nYou provide or provided to Pipory upon registration (“Registration Data”) and at all other times\r\nwill be true, accurate, current and complete and You agree to update Your information as\r\nnecessary to maintain its truth and accuracy.​\r\n4. When You use the Service or other data, information, or communication to Us, You agree\r\nand understand that You are communicating with Us through electronic records and You\r\nconsent to receive communications via electronic records from Us periodically and as and when\r\nrequired. We may communicate with You by email or by such other mode of communication,\r\nelectronic or otherwise.\r\n5. You agree that You will not solicit, collect, or use the login credentials of other YourQuote\r\nUsers.​\r\n6. You must take responsibility for keeping Your username and password safe and secure.\r\n7. Pipory uses third party transaction gateway to send/receive money to/from the users.Pipory is\r\nnot liable for any injury/damage/failure of transaction that occurs either before, during or after\r\nYour use of the Service.\r\n8. You are requested to maintain discretion before adding users on other social networking\r\nplatforms or sharing phone numbers. Pipory shall not be responsible for any harassment the\r\nUser suffers from other users on the Service, or any other platform(s). Please approach the\r\nsupport of those platforms and use the block feature on Pipory to disable them from interacting\r\nwith You. You are responsible for any post related to self-harm that You post on the Service.\r\nPipory is not liable for any injury or damage that occurs either before, during or after Your use of\r\nthe Service.\r\n9. You may not use the Service for any illegal or unauthorized purpose. You agree to comply\r\nwith all laws, rules and regulations applicable to Your use of the Service and Your Content,\r\nincluding but not limited to, copyright laws.\r\n10. You are solely responsible for Your conduct and the Content that You post on Pipory.\r\n\r\n\r\n11. You must not change, modify, adapt or alter the Service or change, modify or alter another\r\nwebsite so as to falsely imply that it is associated with the Service or not modify or alter the\r\nService or modify another website so as to falsely imply that it is associated with Pipory.\r\n11. You must not interfere or disrupt the Service or servers/networks connected to the Service,\r\nincluding by transmitting worms, viruses, spyware and malware or any other code that is\r\ndestructive or disruptive in nature. Interfering with the display of any Pipory’s page in a User’s\r\nbrowser or device is illegal.\r\n12. You shall not create accounts on Pipory using unauthorized means, including but not limited\r\nto, using an automated device, script, bot, spider, crawler, or scraper is not allowed.\r\n13. Pipory reserves the right to distribute Your Content posted on Pipory through its social\r\nmedia handles, with due credits to the User.\r\n14. You must not attempt to restrict another user from using or enjoying the Service and You\r\nmust not encourage or facilitate violations of these Terms of Use or any other Pipory Policies.\r\n15. Violation of these Terms of Use may, in Pipory’s sole discretion, result in termination of Your\r\nPipory account. We are not responsible for any Content that is posted on Pipory. If You violate\r\nthe Terms of Use, or create risk/possible legal exposure for Pipory, we can stop providing all or\r\npart of the Service to You.​\r\n**More terms regarding the App and Coins/Points**\r\n    - The App is proprietary to Us and constitutes Our intellectual property. Any intellectual\r\n       property relating to any products and/or services offered on or through the App may be\r\n       proprietary to Us or Our partners and shall constitute Ours or Our partners’ intellectual\r\n       property as the case may be.\r\n    - Based on the minimum number of coins/points (as mentioned in the App) collected in the\r\n       user’s account, the user can redeem the same either against products and/or services\r\n       offered on or through the App, whether they are offered by Us or by our partners.\r\n       Further, the said coins/points can also be used to avail various discount offers that may\r\n       be made available on or through the App, whether by Us or by our partners. If there are\r\n       any specific or additional terms and conditions attached to any such offered products\r\n       and/or services, then the same will also be applicable and shall form an integral part of\r\n       these App Terms and Conditions.\r\n    - The App is provided currently free of cost. We may convert the App to a\r\n       subscription-based model at a future date. However, We shall communicate the same to\r\n       You as and when We decide to do so.\r\n    - Pipory holds the rights to add/remove coins from/to users account for reasons such as\r\n       but not limited to hacking, robot, reposting content, fake likes etc.\r\n    - ACCOUNT SECURITY\r\n\r\n\r\n**Account Security**\r\nYou shall be solely responsible and liable for maintaining the utmost privacy and confidentiality\r\nof Your App log-in (username and password) details as well as for any and all activities that\r\noccur under Your log-in. You agree to immediately notify Us of any disclosure or unauthorized\r\nuse of Your log-in or any other breach of security by emailing us piporyofficial@gmail.com\r\n**PROPRIETARY RIGHTS**\r\nYou confirm and agree that We or Our partners are the owner of the proprietary information\r\nmade available to You through the App and hereby retain all proprietary and intellectual\r\nproperty rights in the same, including but not limited to all confidential information.\r\n\r\n1. You undertake not to post, copy, modify, transmit, disclose, show in public, create any\r\n    derivative works from, distribute, make commercial use of, or reproduce in any way, and\r\n    whether partly or fully, any (i) confidential or proprietary information, or (ii) copyrighted or\r\n    copyrightable material, trademarks, service marks or other proprietary information\r\n    accessible via the App; whether belonging to Us or not without first obtaining Our prior\r\n    written consent.\r\n2. Other App users may upload/publish/post any copyrighted information, which may have\r\n    copyright protection or not or which may be identified as copyright. You undertake not to\r\n    copy, modify, publish, transmit, distribute, perform, display, commercially use/exploit, sell\r\n    or use such information in any way and for any purpose whatsoever.\r\n**MODIFICATIONS TO THE APP**\r\nWe reserve the right at any time to modify or discontinue, temporarily or permanently, the App\r\n(or any part thereof) with or without notice. You agree that We shall not be liable to You or to\r\nany third party for any modification, suspension or discontinuance of the App. Any access or\r\nusage by You of the App shall imply that You have accepted any new or modified terms and\r\nconditions. Please re-visit these App Terms and Conditions from time to time to stay abreast of\r\nany changes that We may introduce.\r\n**DISCLAIMER OF WARRANTY**\r\n1. To the maximum extent permitted by applicable law, We have provided the App on an\r\n    \"AS IS\" and \"AS AVAILABLE\" and “BEST EFFORTS” basis and grant no warranties of\r\n    any kind, whether express, implied, direct, indirect statutory or otherwise with respect to\r\n    the App or any part thereof (including all content contained therein), including any\r\n    implied warranties of correctness, validity, accuracy, completeness, appropriateness,\r\n    fitness, compatibility for a particular purpose or outcome or non-infringement. We do not\r\n    warrant that the use of the App will always be secured, uninterrupted, available,\r\n    error-free or will meet Your requirements or expectations, or that any defects in the App will be corrected or result in the desired results. We disclaim liability for, and no warranty is made with respect to, the connectivity and availability of the App at all times and the results of the use of the App.\r\n\r\n2. Opinions, advice, statements, offers, or other information or content made available\r\n    through the App, but not directly by Us, are those of their respective authors, and should\r\n    not necessarily be relied upon. Such authors are solely responsible for such Content.\r\n    We do not (i) guarantee the accuracy, completeness or usefulness of any information\r\n    provided on the App, or (ii) adopt, endorse or accept responsibility for the accuracy or\r\n    reliability of any opinion, advice, or statement made by any party other than Us.\r\n3. From time to time, We may offer new features or tools which Our App users may\r\n    experiment or experience. Such features or tools are offered solely for experimental\r\n    purposes and without any warranty of any kind, and may be modified or discontinued at\r\n    Our sole discretion. The provisions of this Disclaimer of Warranty section shall apply with\r\n    full force to such features and tools.\r\n4. We accept no responsibility for any damage, loss, liabilities, injury or disappointment\r\n    incurred or suffered by You as a result of the App.\r\n    **LIMITATION OF LIABILITY**\r\n1. To the maximum extent permitted by applicable law, in no event will We be liable for any\r\n    incidental, special, consequential or indirect damages arising out of or relating to the use\r\n    or inability to use the App, result of using the App, including without limitation, damages\r\n    for recommendation of the App, loss or corruption of data or programs, service\r\n    interruptions and procurement of substitute services, even if we know or have been\r\n    advised of the possibility of such damages. To the maximum extent permitted by\r\n    applicable law, under no circumstances will we be liable for any liquidated or punitive\r\n    damages.\r\n2. To the maximum extent permitted by applicable law, in no event will We be liable for any\r\n    damages whatsoever, whether direct, indirect, general, special, compensatory,\r\n    consequential, and/or incidental, liquidated, punitive arising out of or relating to\r\n    recommendation of the App, the conduct of any App user or anyone else in connection\r\n    with the use of the App, including without limitation, bodily injury, emotional distress,\r\n    financial loss and/or any other damages resulting from communications with other App\r\n    users or as a result of using the App.\r\n**INDEMNIFICATION**\r\nYou agree to indemnify, defend and hold Us harmless, as well as Our partners, affiliates,\r\nsubsidiaries, and each of their respective officers, directors, employees, agents, consultants and\r\nother related or affiliated third parties, from and against any and all losses, claims, costs,\r\nliabilities and expenses (including reasonable attorneys’ fees) relating to or arising out of Your\r\nuse of the App, including but not limited to (i) any violation by You of these App Terms and\r\nConditions, or (ii) any action arising from the Content that You publish on the App or using the\r\nApp that infringes any proprietary or intellectual property rights (e.g. copyright, trade secrets,\r\n\r\n\r\ntrademark or patent) of any third party, or (iii) any content or communication that denigrates,\r\nlibels or invades the privacy right of any third party. We reserve the right, at Our own cost, to\r\nassume the exclusive defense and control of any matter otherwise subject to indemnification by\r\nYou, and You will co-operate fully in asserting any available defenses in such case.\r\n**CAUTION**\r\n\r\n1. We may check new user account profiles strictly for verifying accuracy of profile\r\n    information and any unsuitable, objectionable or inappropriate content. However, We\r\n    may not be able to verify the identity of all such users or the accuracy of their content,\r\n    nor can We guarantee that We will be able to identify all unsuitable, objectionable or\r\n    inappropriate content. Please do not take any user content as fully accurate and/or\r\n    complete. We will not be liable or responsible for any false and misleading content and\r\n    information given by any user. If You have any concerns over any user content, please\r\n    write to us on support@pipory.com with the details thereof.\r\n2. You hereby acknowledge and agree that You shall ensure that at all times Your\r\n    interaction with other users of the App will always be lawful and appropriate and that You\r\n    alone shall be responsible for all consequences thereof."}]